var MainBoard = function() {
	var pageData = null;
	var basePath = '';

	// ****************************************************************************************************
	// 初始化系列方法
	// ****************************************************************************************************
	// 初始化页面数据缓存
	var initPageData = function(params) {
		basePath = params.basePath;
	};

	// 初始化菜单
	var initMenu = function() {
		$('#main_menu').frontEngine('initMainMenu', {
			basePath : basePath,
		});
	};
	
	// ****************************************************************************************************
	// 暴露在外的方法
	// ****************************************************************************************************
	return {
		init: function(params) {
			initPageData(params);
			initMenu();
		}
	};
} ();
